class Solution:
    def isValidSudoku(self, board: list[list[str]]) -> bool:
        # 用 9 个整数（实质上利用它们的二进制比特位）分别记录每一行、每列、每个 3x3 宫的数字状态
        # 初始状态全为 0 
        rows = [0] * 9
        cols = [0] * 9
        boxes = [0] * 9
        
        for i in range(9):
            for j in range(9):
                val = board[i][j]
                if val == '.':
                    continue
                
                # 将字符 '1'-'9' 映射为位移量 0-8
                shift = int(val) - 1
                
                # 计算当前格子位于哪一个 3x3 宫 (编号 0-8)
                box_index = (i // 3) * 3 + j // 3
                
                # 计算掩码 (Mask)：比如 val 取 '5', shift=4, 二进制表现形式即为...10000 
                # 这里意味着把数字 5 用二进制中对应的坑位代表
                mask = 1 << shift
                
                # 检查该数字是否已经在对应行、列、宫中出现过
                # 把 mask 跟对应哈希状态进行按位与(&)操作，如果大于 0 说明这个位子之前已经被占过了 (重复)
                if (rows[i] & mask) or (cols[j] & mask) or (boxes[box_index] & mask):
                    return False
                
                # 走到这里意味着没重复，需要把对应的位子置为 '已使用'
                # 使用按位或(|)运算或者累加都可以，即可将那个位点亮成 1
                rows[i] |= mask
                cols[j] |= mask
                boxes[box_index] |= mask
                
        return True

if __name__ == "__main__":
    board = [
      ["5","3",".",".","7",".",".",".","."],
      ["6",".",".","1","9","5",".",".","."],
      [".","9","8",".",".",".",".","6","."],
      ["8",".",".",".","6",".",".",".","3"],
      ["4",".",".","8",".","3",".",".","1"],
      ["7",".",".",".","2",".",".",".","6"],
      [".","6",".",".",".",".","2","8","."],
      [".",".",".","4","1","9",".",".","5"],
      [".",".",".",".","8",".",".","7","9"]
    ]
    solution = Solution()
    print("-----------------------------------------")
    print("解题方法三运行结果：")
    print(f"当前数独是否有效: {solution.isValidSudoku(board)}")
    print("-----------------------------------------")
